Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties Properties
The AnalysisPartAnalysisProperties type exposes the following members.
Properties
Name | Description
AnalysisClass
 The analysis class of the analysis part.
BuiltupMode
 The builtup mode of the analysis part.
DesignGroup
 The design group of the analysis part.
PhysicalFreezed
 Indicates whether the physical part has been freezed.
Top
See Also
Reference
AnalysisPartAnalysisProperties Class
Tekla.Structures.Analysis Namespace